Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: And whoever makes his prayer to the Lord will have salvation.
chr: ᎯᎠᏃ ᏂᎦᎵᏍᏗᏍᎨᏍᏗ, ᎾᏂᎥᏉ ᎩᎶ ᎠᎾᏓᏙᎵᏍᏗᏍᎨᏍᏗ ᎤᎬᏫᏳᎯ ᏚᏙᎥ ᎠᏅᏗᏍᎨᏍᏗ ᎠᏂᏔᏲᎯᎮᏍᏗ ᎨᏥᏍᏕᎸᏗ ᎨᏎᏍᏗ.”

source: Men of Israel, give ear to these words: Jesus of Nazareth, a man who had the approval of God, as was made clear to you by the great works and signs and wonders which God did by him among you, as you yourselves have knowledge,
chr: ᎢᏥᏍᎦᏯ ᎢᏏᎵ ᏧᏪᏥ ᎢᏣᏛᏓᏍᏓ ᎯᎠ ᏥᏁᎬᎢ. ᏥᏌ ᎾᏎᎵᏗ ᎡᎯ ᏥᎨᏒᎩ ᎤᏁᎳᏅᎯ ᎬᏂᎨᏒ ᎢᏳᏩᏁᎸᎯ ᎢᏤᎲᎢ, ᎾᏍᎩ ᎤᏩᏗᏍᎬ ᎤᏓᎴᎯ ᎠᎴ ᎤᏍᏆᏂᎪᏗ ᎠᎴ ᎤᏰᎸᏛᎢ ᏥᏚᎸᏫᏍᏓᏁᎸᎩ ᎢᏤᎲᎢ, ᎾᏍᎩ ᏂᎯ ᎾᏍᏉ ᏥᏥᎦᏔᎭ,

source: Him, when he was given up, by the decision and knowledge of God, you put to death on the cross, by the hands of evil men:
chr: ᎾᏍᎩ, ᎤᏁᎳᏅᎯ ᎤᏓᏅᏖᎸᎯ ᎠᎴ ᎦᏳᎳ ᎬᏩᎪᎲᎯ ᏥᏂᎨᏎᎢ ᏥᏚᏲᏎᎢ, ᏂᎯ ᎡᏥᏂᏴᎲ ᎠᎴ ᏗᏍᎦᎾ ᏗᏦᏰᏂ ᏕᏨᏔᏅ ᎡᏣᏛᏅ ᎠᎴ ᎡᏥᎸ.

source: But God gave him back to life, having made him free from the pains of death because it was not possible for him to be overcome by it.
chr: ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏕᎤᎴᏔᏅ, ᏕᎤᎦᎵᏒ ᎠᏲᎱᎯᏍᏗ ᎨᏒ ᎡᎯᏍᏗ ᎤᏪᎲᎢ, ᎥᏝᏰᏃ ᏴᎵ ᏂᎪᎯᎸ ᎾᏍᎩ ᎬᏩᏂᏴᏗ ᏱᎨᏎᎢ.

source: For David said of him, I saw the Lord before my face at all times, for he is at my right hand, so that I may not be moved:
chr: ᏕᏫᏰᏃ ᎯᎠ ᏂᎦᏪ ᎾᏍᎩ ᎧᏃᎮᏍᎬᎢ; “ᏂᎪᎯᎸ ᏥᎪᏩᏘᏍᎬᎩ ᏱᎰᏩ ᎢᎬᏱᏢ ᎠᏆᎧᏛᎢ, ᏥᎦᏘᏏᏗᏢᏰᏃ ᎦᏙᎦ, ᎾᏍᎩ ᎥᎩᏖᎸᏗᏱ ᏂᎨᏒᎾ.

source: And for this cause my heart was glad and my tongue full of joy, and my flesh will be resting in hope:
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᎩᎾᏫ ᎣᏏᏳ ᎤᏓᏅᏓᏛᎩ, ᏥᏃᎦᏃ ᎠᎵᎮᎵᎬᎩ, ᎾᏍᏉᏃ ᎠᎩᏇᏓᎸ ᏓᏳᏯᏪᏐᎵ ᎤᏚᎩ ᎬᏗ ᎨᏒᎢ;

source: For you will not let my soul be in hell and you will not give up your Holy One to destruction.
chr: ᎥᏝᏰᏃ ᎠᏆᏓᏅᏙ ᏫᏱᏙᎦᎯᏲᎯ ᏧᏂᏲᎱᏒᎯ ᎤᎾᏤᎵᎪᎯ, ᎥᏝ ᎠᎴ ᎾᏍᎦᏅᎾ ᏣᏤᎵ ᎤᏁᎳᎩ ᏭᎪᎯ ᎦᎯᏰᎵᏎᏗ ᏱᎩ.

source: You have made me see the ways of life; I will be full of joy when I see your face.
chr: ᎬᏂᏛ ᏕᎦᏅᏅ ᏕᏍᎩᎾᏄᎪᏫᏎᎸ, ᎠᎵᎮᎵᏍᏗ ᎨᏒ ᏓᏍᎩᎧᎵᎢᏍᏔᏂ ᏣᎧᏛ ᏛᏔᏂ.”

source: My brothers, I may say to you openly that David came to his death, and was put in the earth, and his resting-place is with us today.
chr: ᎢᏥᏍᎦᏯ ᎢᏓᏓᏅᏟ ᏂᏥᏍᎦᎢᎲᎾ ᎠᎦᏴᎵᎨ ᏕᏫ ᎢᏨᏃᎮᎯᏏ, ᎾᏍᎩ ᎤᏲᎱᏒᎢ ᎠᎴ ᎠᏥᏂᏌᏅᎢ, ᎤᏤᎵᏃ ᎠᏤᎵᏍᏛ ᎠᏏ ᎪᎯ ᏥᎩ ᎢᎦᏓᏑᏴᎢ.

source: But being a prophet, and having in mind the oath which God had given to him, that of the fruit of his body one would take his place as a king,
chr: ᎠᏙᎴᎰᏍᎩᏍᎩᏂ ᎨᏒ ᎢᏳᏍᏗ, ᎠᎴ ᎠᎦᏔᎯᏳ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏎᎵᏔᏅ ᎤᏁᏤᎸᎢ, ᎠᏰᎵ ᎤᏇᏓᎵ ᎨᏒ ᎤᎾᏄᎪᏫᏍᏗᏱ ᎦᎶᏁᏛ, ᎾᏍᎩ ᎤᏪᏅ ᎤᏪᏗᏱ,

source: He, having knowledge of the future, was talking of the coming again of Christ from the dead, that he was not kept in hell and his body did not see destruction.
chr: ᎾᏍᎩ ᎯᎠ ᎠᏙᎴᎰᏍᎬᎢ ᏅᏧᎵᏍᏙᏔᏁᎢ, ᎦᎶᏁᏛ ᏧᎴᎯᏐᏗ ᎨᏒ ᎤᏃᎮᎴᎢ, ᎾᏍᎩ ᎤᏓᏅᏙ ᏫᏂᏓᏥᏲᎯᏎᎸᎾ ᎨᏒ ᏧᏂᏲᎱᏒᎯ ᎤᎾᏤᎵᎪᎯ, ᎠᎴ ᎾᏍᎩ ᎤᏇᏓᎵ ᏄᎪᏒᎾ ᎨᏒᎢ.

source: This Jesus God has given back to life, of which we all are witnesses.
chr: ᎾᏍᎩ ᎯᎠ ᏥᏌ ᎤᏁᎳᏅᎯ ᏕᎤᎴᏔᏅ, ᎠᎴ ᎾᏍᎩ ᎠᏴ ᏂᎦᏛ ᎣᏥᏃᎮᏍᎩ.

source: And so, being lifted up to the right hand of God, and having the Father's word that the Holy Spirit would come, he has sent this thing, which now you see and have knowledge of.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏁᎳᏅᎯ ᎠᎦᏘᏏ ᎤᏬᏰᏂ ᎤᏩᏔᏅᎯ ᎤᏌᎳᏓᏅᎯ ᎨᏒᎢ, ᎠᎴ ᎠᎦᏴᎵᎨ ᎤᏚᎢᏍᏓᏁᎸᎯ ᎨᏒ ᏧᏁᏗᏱ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎤᏪᏐᏅᏴ ᎯᎠ ᎪᎯ ᏥᏥᎪᏩᏘᎭ ᎠᎴ ᏥᏣᏛᎩᎭ.

source: For David has not gone up into heaven, but says, himself, The Lord said to my Lord, Be seated at my right hand,
chr: ᏕᏫᏰᏃ ᎥᏝ ᏳᎵᏌᎳᏓᏅ ᎦᎸᎳᏗ ᏫᏳᎶᏒ, ᎯᎠᏰᏃ ᏂᎦᏪ ᎤᏩᏒ; “ᏱᎰᏩ ᎯᎠ ᏄᏪᏎᎸ ᎤᎬᏫᏳᎯ ᎠᏆᏤᎵᎦ; ᏥᎦᏘᏏ ᎢᏗᏢ ᏦᎴᏍᏗ,

source: Till I put all those who are against you under your feet.
chr: ᎬᏂ ᎨᏣᏍᎦᎩ ᏗᏣᎳᏏᏗᏱ ᎦᏍᎩᎶ ᏂᎦᏥᏴᏁᎸᎭ.”

source: For this reason, let all Israel be certain that this Jesus, whom you put to death on the cross, God has made Lord and Christ.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎾᏂᎥ ᎢᏏᎢ ᏏᏓᏁᎸᎯ ᎨᏒ ᎤᏙᎯᏳᏒ ᏩᎾᏙᎴᎰᎯ, ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎠᎴ ᎦᎶᏁᏛ ᏄᏩᏁᎸ ᎾᏍᎩ ᏥᏌ ᏂᎯ ᏤᏣᏛᏅᎩ.

source: Now when these words came to their ears their hearts were troubled, and they said to Peter and the other Apostles, Brothers, what are we to do?
chr: ᎿᏉᏃ ᎾᏍᎩ ᎤᎾᏛᎦᏅ ᏧᏂᎾᏫᏱ ᏚᏂᏣᏲᎴᎢ; ᎯᎠᏃ ᏂᏚᏂᏪᏎᎴ ᏈᏓ ᎠᎴ ᎠᏂᏐᎢ ᎨᏥᏅᏏᏛ; ᎢᏥᏍᎦᏯ ᎢᏓᏓᏅᏟ, ᎦᏙ ᏓᏲᏣᏛᏁᎵ?

source: And Peter said, Let your hearts be changed, every one of you, and have baptism in the name of Jesus Christ, for the forgiveness of your sins; and you will have the Holy Spirit given to you.
chr: ᏈᏓᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᏂᏥᎥ ᏗᏥᏁᏟᏴᎾ ᏕᏣᏓᏅᏛᎢ, ᎠᎴ ᏫᏕᏣᏬᏣ, ᏥᏌ ᎦᎶᏁᏛ ᏕᎤᏙᏍᏛᎢ, ᎡᏥᏙᎵᏍᏗᏱ ᎢᏥᏍᎦᏅᏨᎢ; ᎦᎸᏉᏗᏳᏃ ᎠᏓᏅᏙ ᏓᏰᏥᏁᎵ.

source: For the word of God is for you and for your children and for all those who are far off, even all those who may be marked out by the Lord our God.
chr: ᏂᎯᏰᏃ ᎡᏥᏚᎢᏍᏓᏁᎸᎯ ᎠᎴ ᏗᏤᏥ ᎠᎴ ᎾᏂᎥ ᎢᏅ ᏗᏁᎯ, ᎾᏍᎩ ᎾᏂᎥ ᎤᎬᏫᏳᎯ ᎤᏁᎳᏅᎯ ᎢᎦᏤᎵ ᏧᏯᏅᏗ ᎨᏒᎢ.

source: And with more such words he gave his witness, offering them salvation and saying, Come out from this evil generation.
chr: ᎠᎴ ᎤᏣᏖ ᎤᏟ ᎢᎦᎢ ᎢᎧᏁᏨᎯ ᏚᏬᏁᏔᏁᎢ ᎯᎠ ᏄᏪᏎᎢ; ᏗᏣᎵᏏ ᎯᎠ ᏂᏚᏳᎪᏛᎾ ᎢᏯᎾᏛᏁᎯ ᏣᏁᎭ.

source: Then those who gave hearing to his words had baptism: and about three thousand souls were joined to them that day.
chr: ᎿᏉᏃ ᎤᏁᏨ ᎤᎵᎮᎵᏨᎯ ᏗᎬᏩᏓᏂᎸᏤᎯ ᏕᎨᎦᏬᎡᎢ, ᎾᎯᏳᏃ ᎢᎦ ᎤᏂᏁᏉᏤ ᏦᎢ ᎢᏯᎦᏴᎵ ᎢᏴᏛ.

source: And they kept their attention fixed on the Apostles' teaching and were united together in the taking of broken bread and in prayer.
chr: ᎾᏍᎩᏃ ᎤᎵᏂᎩᏗᏳ ᏚᏂᎸᏫᏍᏓᏁᎮ ᎨᏥᏅᏏᏛ ᏓᎾᏕᏲᎲᏍᎬᎢ, ᎠᎴ ᎤᎾᎵᎪᏒᎢ, ᎠᎴ ᎦᏚ ᎠᏂᎬᎭᎷᏯᏍᎬᎢ, ᎠᎴ ᎠᎾᏓᏙᎵᏍᏗᏍᎬᎢ.

source: But fear came on every soul: and all sorts of wonders and signs were done by the Apostles.
chr: ᎾᏂᎥᏃ ᏴᏫ ᎤᎾᏰᎯᏍᏗᏳ ᎤᎾᏓᏅᏓᏕᎢ, ᎤᏣᏖᏃ ᏧᏓᎴᏅᏛ ᎤᏍᏆᏂᎪᏗ ᎠᎴ ᎤᏰᎸᏛ ᏚᏂᎸᏫᏍᏓᏁᎮ ᎨᏥᏅᏏᏛ.

source: And all those who were of the faith kept together, and had all things in common;
chr: ᎾᏂᎥᏃ ᎠᏃᎯᏳᎲᏍᎩ ᎤᎾᏓᏡᎨᎢ, ᎠᎴ ᎠᏰᎵᏉ ᏄᏅᏁ ᏂᎦᎥ ᏧᎬᏩᎶᏗ ᎤᏂᎲᎢ;

source: And exchanging their goods and property for money, they made division of it among them all, as they had need.
chr: ᎠᎴ ᏓᏂᎾᏕᎨ ᏚᏂᎶᎨᏒ ᎠᎴ ᏧᎬᏩᎶᏗ ᎤᏂᎲᎢ, ᎠᎴ ᏓᏂᏯᏙᎮᎮ ᎾᏂᎥ ᎾᏍᎩᏯ ᎤᏂᏂᎬᏎᎲᎢ.

source: And day by day, going in agreement together regularly to the Temple and, taking broken bread together in their houses, they took their food with joy and with true hearts,
chr: ᏂᏚᎩᏨᏂᏒᏃ ᏌᏉ ᎢᎦᎦᏛ ᎠᏁᏙᎮ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎠᎴ ᎦᏚ ᎠᏂᎬᎭᎷᏯᏍᎨ ᏓᏓᏁᎳᏗᏒᎢ, ᏓᎾᎵᏍᏓᏴᎲᏍᎨ ᎠᎾᎵᎮᎵᎨ ᎠᎴ ᎤᏠᎾᏍᏗ ᏄᏓᏑᏴᎾ ᎨᏎ ᏧᏂᎾᏫᏱ,

source: Giving praise to God, and having the approval of all the people; and every day the number of those who had salvation was increased by the Lord.
chr: ᎠᏂᎸᏉᏗᏍᎨ ᎤᏂᎳᏅᎯ, ᎠᎴ ᎾᏂᎥ ᏴᏫ ᎬᏫᏂᎨᏳᎯᏳ ᎨᏎᎢ. ᎤᎬᏫᏳᎯᏃ ᏂᏚᎩᏨᏂᏒ ᎤᎾᎵᎪᏒ ᏕᎠᎵᎪᏗᏍᎨ ᎾᏍᎩ ᎨᏥᏍᏕᎸᏗ ᎨᏒᎢ.

source: Now Peter and John were going up to the Temple at the ninth hour, the hour of prayer;
chr: ᏈᏓᏃ ᎠᎴ ᏣᏂ ᎢᏧᎳᎭ ᎤᏁᏅᎭ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎠᏓᏙᎵᏍᏙᏗᏱ ᎨᏒ ᎢᏳᎢ, ᏦᎢᏁ ᎢᏳᏟᎶᏛ ᎧᎳᏩᏗᏒᎢ.

source: And a certain man who from birth had had no power in his legs, was taken there every day, and put down at the door of the Temple which is named Beautiful, requesting money from those who went into the Temple;
chr: ᎩᎶᏃ ᎢᏳᏍᏗ ᎠᏍᎦᏯ ᎠᏲᎤᎵ ᏂᎨᏎ ᎤᏕᏅ-ᎠᏥᏁᎨᎢ, ᎾᏍᎩ ᏂᏚᎩᏨᏂᏒ ᎠᏂᎧᎲᏍᎨ ᎦᎶᎯᏍᏗᏳᎶᏗ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᎾᏍᎩ ᎦᎶᎯᏍᏗᏱ ᎤᏬᏚᎯ ᏥᏕᎤᏙᎥ, ᏧᏚᎳᏕᏗᏱ ᎤᏂᏰᎸᏎ ᎠᏂᏴᎯᎯ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ.

source: He then, seeing Peter and John going into the Temple, made a request to them.
chr: ᎾᏍᎩ ᏕᎤᎪᎲ ᏈᏓ ᎠᎴ ᏣᏂ ᎿᏉ ᏗᏂᏴᎵᏎ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᏚᏚᎳᏕᎴᎢ.

source: And Peter, looking at him, with John, said, Keep your eyes on us.
chr: ᏈᏓᏃ ᎤᏯᏅᏒᎯ ᏚᎧᎿᏁᎢ, ᎠᎴ ᎾᏍᏉ ᏣᏂ; ᏈᏓᏃ ᎯᎠ ᏄᏪᏎᎢ, ᏗᏍᎩᎾᎦᏅᎦ.

source: And he gave attention to them, hoping to get something from them.
chr: ᏕᎤᏬᎯᏳᏁᏃ, ᎪᎱᏍᏗ ᏓᎬᎩᏁᎵ ᎡᎵᏍᎨᎢ.

source: But Peter said, I have no silver or gold, but what I have, that I give to you. In the name of Jesus Christ of Nazareth, get up on your feet.
chr: ᎿᏉᏃ ᏈᏓ ᎯᎠ ᏄᏪᏎᎢ; ᎠᏕᎸ ᎤᏂᏁᎬ ᎠᎴ ᎠᏕᎸ ᏓᎶᏂᎨ ᎥᏝ ᏱᏓᎩᎭ, ᎢᏳᏍᏗᏍᎩᏂᏃᏅ ᎠᎩᎲ ᎬᎥᏏ; ᏥᏌ ᎦᎶᏁᏛ ᎾᏎᎵᏗ ᏤᎲ ᏕᎤᏙᏍᏛ ᏔᎴᎲᎦ ᎠᎴ ᎮᏓ.

source: And he took him by his right hand, lifting him up; and straight away his feet and the bones of his legs became strong,
chr: ᎠᎦᏘᏏᏃ ᎤᏬᏯᏁᏒ ᏕᎤᎴᏔᏁᎢ; ᎩᎳᏉᏃ ᎢᏴᏛ ᏧᎳᏏᏕᏂ ᎠᎴ ᏗᏓᏆᎵᎢ ᏧᎵᏂᎩᏗᏳ ᏂᏚᎵᏍᏔᏁᎢ.

source: And, jumping up, he got on to his feet and went into the Temple with them, walking and jumping and giving praise to God.
chr: ᎾᏍᎩᏃ ᏚᎵᏔᏗᏅᏎᎢ, ᎤᎴᏁᎢ, ᎠᎴ ᎤᏪᏙᎴᎢ, ᎠᎴ ᎢᏧᎳᎭ ᏭᏂᏴᎴ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎡᏙᎮᎢ, ᎠᎴ ᏓᎵᏔᏕᎨᎢ, ᎠᎴ ᎦᎸᏉᏗᏍᎨ ᎤᏁᎳᏅᎯ.

source: And all the people saw him walking and praising God:
chr: ᏂᎦᏛᏃ ᏴᏫ ᎬᏩᎪᎮ ᎡᏙᎲᎢ ᎠᎴ ᎦᎸᏉᏗᏍᎬ ᎤᏁᎳᏅᎯ.

source: And they saw that it was the man who made requests for money at the door of the Temple, and they were full of wonder and surprise at what had taken place.
chr: ᎬᏬᎵᏤᏃ ᎾᏍᎩ ᎨᏒ ᎤᏚᎳᏗᏍᏗᏱ ᏧᏰᎸᏎ ᏥᎦᎲᏍᎨ ᎤᏬᏚᎯ ᎦᎶᎯᏍᏗᏱ ᎤᏛᏅ-ᏗᎦᎳᏫᎢᏍᏗᏱ. ᎤᏣᏔᏅᎯᏃ ᎤᏂᏍᏆᏂᎪᏎ ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎾᏍᎩ ᏄᎵᏍᏓᏁᎸᎢ.

source: And while he kept his hands on Peter and John, all the people came running together to the covered way which is named Solomon's, full of wonder.
chr: ᎠᏏᏉᏃ ᎠᏥᏅᏩᏅᎯ ᎠᏲᎤᎵ ᏕᎤᏂᏴᏎ ᏈᏓ ᎠᎴ ᏣᏂ, ᏂᎦᏛ ᏴᏫ ᏕᎬᏩᏂᏔᏫᏤ ᎠᏲᏓᏝᎲᎢ ᏐᎵᎹᏅ ᎤᏤᎵ ᏥᏕᎤᏙᎥ, ᎤᏣᏔᏅᎯ ᎤᏂᏍᏆᏂᎪᏍᎨᎢ.

source: And when Peter saw it he said to the people, You men of Israel, why are you so greatly surprised at this man? or why are you looking at us as if by our power or virtue we had given him the use of his legs?
chr: ᏈᏓᏃ ᎤᏙᎴᎰᏒ ᎯᎠ ᏂᏚᏪᏎᎴ ᏴᏫ; ᎢᏥᏍᎦᏯ ᎢᏏᎵ ᏧᏪᏥ, ᎦᏙᏃ ᎢᏥᏍᏆᏂᎪᏍᎦ ᎯᎠ, ᎠᎴ ᎦᏙᏃ ᎤᏯᏅᏒᎯ ᏙᏍᎩᎾᎦᏂᎭ, ᎾᏍᎩᏯ ᎣᎩᏅᏒ ᏙᎩᎾᎵᏂᎬᎬ ᎠᎴ ᎣᏍᏙᏏᏳ ᎨᏒ ᏦᎩᏅᏔᏃᎢ ᎯᎠ ᎬᏪᏓᏍᏗ ᏥᏃᏍᏛᏁᎶᎢ.

source: The God of Abraham, of Isaac, and of Jacob, the God of our fathers, has given glory to his servant Jesus; whom you gave up, turning your backs on him, when Pilate had made the decision to let him go free.
chr: ᎤᏁᎳᏅᎯ ᎡᏆᎭᎻ ᎤᏤᎵᎦ, ᎠᎴ ᎡᏏᎩ ᎤᏤᎵᎦ, ᎠᎴ ᏤᎦᏈ ᎤᏤᎵᎦ, ᎤᏁᎳᏅᎯ ᏗᎩᎦᏴᎵᎨ ᎤᎾᏤᎵᎦ, ᎤᎸᏉᏔᏅ ᎤᏪᏥ ᏥᏌ, ᎾᏍᎩ ᏂᎯ ᏥᏕᏥᏲᏒᎩ ᎠᎴ ᏤᏣᏓᏱᎸᎩ ᎠᎦᏔᎲ ᏆᎴᏗ, ᎾᏍᎩ ᎤᏪᎪᏗᏱ ᏧᏰᎸᏒᎩ.

source: But you would have nothing to do with the Holy and Upright One, and made request for a man of blood to be given to you,
chr: ᎠᏎᏃ ᏂᎯ ᎡᏣᏓᏱᎸᎩ ᎾᏍᎩ ᎾᏍᎦᏅᎾ ᎠᎴ ᎤᏓᏅᏘ, ᎢᏥᏔᏲᎸᎩᏃ ᎤᏓᎸᎯ ᎡᏥᎧᏁᏗᏱ

source: And put to death the Lord of life; whom God gave back from the dead; of which fact we are witnesses.
chr: ᎠᎴ ᎤᎬᏫᏳᎯ ᎬᏂᏛ ᎠᏓᏁᎯ ᎡᏥᎸᎩ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏕᎤᎴᏔᏅ ᎤᏲᎱᏒᎢ, ᎾᏍᎩᏃ ᎠᏴ ᎣᏍᏗᏃᎮᏍᎩ.

source: And his name, through faith in his name, has made this man strong, whom you see and have knowledge of: yes, the faith which is through him has made him well, before you all.
chr: ᎠᎴ ᎾᏍᎩ ᏚᏙᎥ ᎪᎯᏳᏗ ᎨᏒ ᏅᏧᎵᏍᏙᏔᏅ ᎾᏍᎩ ᏚᏙᎢ ᎤᎵᏂᎪᎯᏍᏔᏅ ᎯᎠ ᎠᏍᎦᏯ, ᎾᏍᎩ ᏤᏥᎪᏩᏘᎭ ᎠᎴ ᏤᏥᎦᏔᎭ; ᎥᎥ, ᎪᎯᏳᏗ ᎨᏒ ᎾᏍᎩ ᎤᏤᎵᎦ ᎯᎠ ᎤᏃᏍᏛᏯ ᏄᏩᏁᎸ ᎢᏥᎦᏔᎲ ᏂᎦᏛ.

source: And now, my brothers, I am conscious that you did this, as did your rulers, without knowledge.
chr: Ꭷ ᎢᏓᏓᏅᏟ ᏥᎦᏔᎭ ᏂᏥᎦᏔᎲᎾ ᎨᏒ ᏅᏧᎵᏍᏙᏔᏅ ᎾᏍᎩ ᏂᏣᏛᏁᎸᎢ, ᎠᎴ ᎾᏍᏉ ᏗᏣᏤᎵ ᎤᏂᎬᏫᏳᎯ.

source: But the things which God had made clear before, by the mouth of all the prophets, that the Christ would have to undergo, he has put into effect in this way.
chr: ᎾᏍᎩᏍᎩᏂ ᎯᎠ ᏥᏄᎵᏍᏔᏅ ᎤᏁᎳᏅᎯ ᎤᎧᎵᎸ ᎾᏍᎩ ᎦᏳᎳ ᎬᏂᎨᏒ ᎢᏳᏩᏁᎸᎯ ᏥᎨᏎᎢ ᎦᎶᏁᏛ ᎤᎩᎵᏲᎢᏍᏗᏱ, ᏂᎦᏛ ᏧᏤᎵ ᎠᎾᏙᎴᎰᏍᎩ ᏗᏂᎰᎵ ᏥᏕᎬᏗᏍᎨᎢ.

source: So then, let your hearts be changed and be turned to God, so that your sins may be completely taken away, and times of blessing may come from the Lord;
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏗᏥᏁᏟᏴᎾ ᏕᏣᏓᏅᏛᎢ, ᎠᎴ ᎢᏣᎦᏔᎲᎾ, ᎤᏓᏅᎦᎸᏗᏱ ᎢᏥᏍᎦᏅᏨᎢ, ᎾᏍᎩ ᎣᏍᏛ ᎠᏓᏅᏓᏗᏍᏗ ᎨᏒ ᎤᎾᏄᎪᎢᏍᏗᏱ ᎤᎬᏫᏳᎯᏱ ᏅᏓᏳᏓᎴᏅᎯ.

source: And that he may send the Christ who was marked out for you from the first, even Jesus:
chr: ᎠᎴ ᏅᏓᏳᏅᏍᏗᏱ ᏥᏌ ᎦᎶᏁᏛ, ᎾᏍᎩ ᎦᏳᎳ ᎡᏣᎵᏥᏙᏁᎸᎯ ᏥᎩ;

source: Who is to be kept in heaven till the time when all things are put right, of which God has given word by the mouth of his holy prophets, who have been from the earliest times.
chr: ᎾᏍᎩ ᎦᎸᎳᏗ ᏭᏕᏗ ᏥᎩ ᎬᏂ ᎾᎯᏳ ᎠᎵᏱᎶᎸᎭ ᎤᏓᏁᏟᏴᏍᏗ ᎨᏒ ᏂᎦᎥᎢ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎤᏁᏨᎯ ᏥᎩ ᏧᏤᎵ ᎨᏥᎸᏉᏗ ᎠᎾᏙᎵᎰᏍᎩ ᏗᏂᎰᎵ ᏧᏩᏔᏅᎯ ᏥᎩ, ᎡᎶᎯ ᏧᏙᏢᏅᎢ ᏅᏓᎬᏩᏓᎴᏅᏛ.

source: For Moses said, The Lord will give you a prophet from among your people, like me; you will give ear to everything which he will say to you.
chr: ᎼᏏᏰᏃ ᎯᎠ ᏂᏕᎤᏪᏎᎴ ᏗᎩᏙᏓ; “ᏱᎰᏩ ᎢᏣᏁᎳᏅᎯ ᏓᏥᎾᏄᎪᏫᏎᎵ ᎠᏙᎴᎰᏍᎩ ᎢᏣᎵᏅᏟ ᎨᏒ ᏓᎦᎾᏄᎪᏥ, ᎠᏴ ᎾᏍᎩᏯᎢ; ᎾᏍᎩ ᏓᏰᏣᏛᏓᏍᏓᏁᎵ ᏂᎦᎥ ᎢᏥᏁᏤᏗ ᎨᏒᎢ.

source: And every soul who does not give attention to that prophet, will be cut off from among the people.
chr: ᎯᎠᏃ ᏅᏓᎦᎵᏍᏔᏂ ᎾᏍᎩ ᎩᎶ ᏂᎪᎯᏳᎲᏍᎬᎾ ᎢᎨᏎᏍᏗ ᎾᏍᎩ ᎠᏙᎴᎰᏍᎩ, ᎠᏥᏛᏙᏗ ᎠᎨᎳᏗᏍᏗ ᎨᏎᏍᏗ ᎤᏓᏑᏴ ᏴᏫ ᎠᏁᎲᎢ.”

source: And all the prophets from Samuel and those who came after, every one of them, gave word of these days.
chr: ᎠᎴ ᎾᏍᏉ ᏂᎦᏛ ᎠᎾᏙᎴᎰᏍᎩ ᏌᎻ ᏅᏓᏳᏓᎴᏅᏛ, ᎾᏍᎩ ᎣᏂ ᎤᏂᎾᏄᎪᏨᎯ, ᎾᏂᎥ ᎤᏂᏬᏂᏒᎯ, ᎾᏍᏉ ᎤᏂᏁᎢᏍᏔᏅ ᎪᎯ ᎨᏒᎢ.

source: You are the sons of the prophets, and of the agreement which God made with your fathers, saying to Abraham, Through your seed a blessing will come on all the families of the earth.
chr: ᏂᎯ ᎠᎾᏙᎴᎰᏍᎩ ᏧᏁᏥ, ᎠᎴ ᎾᏍᏉ ᏧᏪᏥ ᎠᏚᎢᏍᏛᎢ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏗᎩᎦᏴᎵᎨ ᏚᏚᎢᏍᏓᏁᎸᎢ, ᎯᎠ ᏥᏄᏪᏎᎴ ᎡᏆᎭᎻ; “ᎠᎴ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᎨᏒ ᏅᏓᎦᎵᏍᏙᏔᏂ ᏄᎾᏓᎴᏒ ᏴᏫ ᎡᎶᎯ ᎠᏁᎯ ᎣᏏᏳ ᎢᏳᎾᎵᏍᏓᏁᏗ ᎨᏎᏍᏗ.”

source: To you, first, God sent his servant, blessing you by turning every one of you from his sins.
chr: ᎤᏁᎳᏅᎯ, ᎤᎾᏄᎪᏫᏒ ᎤᏪᏥ ᏥᏌ, ᏂᎯ ᎢᏤᎲ ᎢᎬᏱ ᎤᏅᏒᎩ ᎣᏍᏛ ᎢᏣᏛᏁᏗᏱ ᏕᏥᎦᏔᎲᏍᎬ ᏗᏥᏲᎯᏍᏗᏱ ᏂᏨᏁᎲ ᏂᏥᎥ ᎢᏥᏍᎦᏅᏨᎢ.

source: And while they were talking to the people, the priests and the captain of the Temple and the Sadducees came up to them,
chr: ᎠᏏᏉᏃ ᏓᏂᏬᏁᏗᏍᎨ ᏴᏫ, ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᎣᏍᏛ ᎢᏳᏩᎿᏕᎩ ᎤᏛᏅ-ᏗᏚᎳᏫᎢᏍᏗᏱ ᎠᎴ ᎠᏂᏌᏚᏏ ᎬᏩᏂᏃᎴᎢ;

source: Being greatly troubled because they were teaching the people and preaching Jesus as an example of the coming back from the dead.
chr: ᎤᏥᏐᏅᏤᎮ ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᏓᏁᏲᎲᏍᎬ ᏴᏫ, ᎠᎴ ᏥᏌ ᎠᏅᏗᏍᎬ ᎠᎾᎵᏥᏙᎲᏍᎬ ᎠᏲᎱᏒ ᏗᎴᎯᏐᏗ ᎨᏒᎢ.

source: And they took them and put them in prison till the morning, for it was now evening.
chr: ᎠᎴ ᏕᎬᏩᏂᏂᏴᎨ ᎠᎴ ᏕᎬᏩᏂᏍᏚᏁ ᎤᎩᏨᏛ ᎢᎪᎯᏛ, ᎿᏉᏰᏃ ᎤᏒᎢ ᎨᏎᎢ.

source: But a number of those who gave hearing to the word had faith; and they were now about five thousand.
chr: ᎠᏎᏃ ᎤᏂᏣᏖ ᎧᏃᎮᏛ ᎤᎾᏛᎦᏅᎯ ᎤᏃᎯᏳᏁᎢ, ᎾᏍᎩᏃ ᎠᏂᏍᎦᏯ ᎯᏍᎩᎭ ᎢᏯᎦᏴᎵ ᎾᏂᎡᎢ.

source: And on the day after, the rulers and those in authority and the scribes came together in Jerusalem;
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁ ᎤᎩᏨᏛ, ᎾᏍᎩ ᎤᏂᎬᏫᏳᎯ ᏧᎾᏤᎵ ᎠᎴ ᏗᏂᎳᏫᎩ ᎠᎴ ᏗᏃᏪᎵᏍᎩ,

source: And Annas, the high priest, was there, and Caiaphas and John and Alexander, and all the relations of the high priest.
chr: ᎠᎴ ᎡᎾ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ, ᎠᎴ ᎧᏱᏆ ᎠᎴ ᏣᏂ ᎠᎴ ᎡᎵᎩ ᎠᎴ ᏂᎦᏛ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᎪᎱᏍᏗ ᏧᏩᏅ ᏚᏂᎳᏫᏤ ᏥᎷᏏᎵᎻ.

source: Then sending for Peter and John, they said, By what power and in whose name have you done this?
chr: ᎠᏰᎵᏃ ᏚᏂᎧᏅ ᎯᎠ ᏄᏂᏪᏎ ᏚᎾᏛᏛᏁᎢ; ᎦᎪ ᎤᎵᏂᎬᎬᎢ ᎠᎴ ᎦᎪ ᎦᏙᎥ ᎢᏍᏛᏔᏅ, ᎯᎠ ᏂᏍᏓᏛᏁᎸ?

source: Then Peter, being full of the Holy Spirit, said to them, O you rulers of the people and men of authority,
chr: ᎿᏉᏃ ᏈᏓ ᎤᎧᎵᏨᎯ ᎨᏎ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ, ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᎢᏥᎬᏫᏳᎯ ᏴᏫ ᏧᎾᏤᎵᎦ ᎠᎴ ᎢᏏᎵ ᏗᏥᎳᏫᏤᎯ,

source: If we are questioned today about a good work done to a man who was ill, as to how he has been made well,
chr: ᎢᏳᏃ ᎣᏍᏛ ᏃᏍᏓᏛᏁᎸᎢ ᎯᎠ ᎠᏲᎤᎵ ᎠᏍᎦᏯ, ᎢᏳᏍᏗ ᎬᏔᏅᎯ ᎨᏒ ᎠᏥᏅᏩᏅᎢ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ ᎪᎯ ᎢᎦ ᎢᎣᎩᎾᎵᏱᎵᏕᎮᏍᏗ,

source: Take note, all of you, and all the people of Israel, that in the name of Jesus Christ of Nazareth, whom you put to death on the cross, whom God gave back from the dead, even through him is this man now before you completely well.
chr: ᎢᏥᎦᏔᎮᏍᏗ ᏂᎦᏛ, ᎠᎴ ᏂᎦᏛ ᎢᏏᎵ ᎠᏁᎯ ᎠᏂᎦᏔᎮᏍᏗ ᎾᏍᎩ ᏕᎤᏙᎥ ᏥᏌ ᎦᎶᏁᏛ ᎾᏎᎵᏗ ᏤᎲᎩ, ᎾᏍᎩ ᏓᏓᎿᏩᏍᏛ ᏤᏣᏛᏅᎩ, ᎤᏁᎳᏅᎯ ᏥᏕᎤᎴᏔᏅ ᎤᏲᎱᏒᎢ, ᎾᏍᎩ ᏄᏩᏂᏌᏅ ᎯᎠ ᎠᏍᎦᏯ ᎤᏗᏩᏒᎯ ᏥᎦᏙᎦ ᏕᏥᎧᏅᎢ.

source: He is the stone which you builders had no use for, but which has been made the chief stone of the building.
chr: ᎾᏍᎩᏍᎩᏂ ᎯᎠ ᏅᏯ ᏥᏥᏲᎢᏎᎸᎩ ᏗᏣᏁᏍᎨᏍᎩ; ᎾᏍᎩ ᎤᏅᏏᏴ ᏄᎬᏫᏳᏒ ᎠᏗ ᏥᏄᎵᏍᏔᏅ.

source: And in no other is there salvation: for there is no other name under heaven, given among men, through which we may have salvation.
chr: ᎥᏝ ᎠᎴ ᏅᏩᏓᎴ ᎩᎶᎢ ᎠᎵᏍᏕᎸᏙᏗ ᎨᏒ ᏳᎭ, ᎥᏝᏰᏃ ᏅᏩᏓᎴ ᏕᎤᏙᎥ ᎦᎸᎶ ᎭᏫᏂᏗᏢ ᏴᏫ ᎠᏁᎲ ᎠᎵᏍᎪᎸᏔᏅᎯ ᏱᎩ ᎢᎦᎵᏍᏕᎸᏙᏗ.

source: Now when they saw that Peter and John were without fear, though they were men of no education or learning, they were greatly surprised; and they took note of them that they had been with Jesus.
chr: ᎤᎾᏙᎴᎰᏒᏃ ᏈᏓ ᎠᎴ ᏣᏂ ᎾᏂᏯᎦᎢᎲᎾ ᎨᏒᎢ, ᎠᎴ ᎤᎾᏓᏅᏖᎸ ᎪᏪᎵ ᏂᏓᏂᏏᎾᏒᎾ ᎠᎴ ᎾᏂᎦᏔᎿᎥᎾ ᎨᏒᎢ, ᎤᏂᏍᏆᏂᎪᏎᎢ, ᎠᎴ ᏚᏃᎵᏤ ᎾᏍᎩ ᏥᏌ ᎤᏁᏙᎸᎯ ᎨᏒᎢ.

source: And, seeing that the man who had been made well was there with them, they were not able to say anything against it.
chr: ᎠᏂᎪᏩᏘᏍᎨᏃ ᎠᏍᎦᏯ ᎠᏥᏅᏩᏅᎯ ᎢᏧᎳᎭ ᎠᏂᏙᎾᎡᎢ, ᎥᏝᏃ ᎪᎱᏍᏗ ᏫᎬᏩᎾᏛᏗ ᏱᎨᏎᎢ.

source: But when they had given them orders to go out of the Sanhedrin, they had a discussion among themselves,
chr: ᎠᏎᏃ ᏚᏂᏁᏥᎸ ᎤᏂᏄᎪᎢᏍᏗᏱ ᏓᏂᎳᏫᎥᎢ ᎤᏅᏒ ᎨᏒ ᎤᎾᎵᏃᎮᎴᎢ,

source: Saying, What are we to do with these men? for certainly it is clear to all who are living in Jerusalem that a most important sign has been done by them, and it is not possible to say that it is not so.
chr: ᎯᎠ ᏄᏂᏪᏎᎢ; ᎦᏙ ᏙᏓᏛᏁᎵ ᎯᎠ ᎠᏂᏍᎦᏯ, ᏄᏜᏏᏛᏒᎾᏰᏃ ᎤᏍᏆᏂᎪᏗ ᏚᏂᎸᏫᏍᏓᏁᎸ ᎬᏂᎨᏒ ᏄᎾᎵᏍᏓᏁᎸ ᏂᎦᏛ ᏥᎷᏏᎵᎻ ᎠᏁᎯ, ᎠᎴ ᎥᏝ ᏰᎵ ᏴᎨᏓᏓᏱᎦ.

source: But so that it may not go farther among the people, let us put them in fear of punishment if they say anything in future in this name.
chr: ᎠᏎᏃ ᎤᏟ ᎢᎦᎢ ᏧᏃᏣᎶᎢᏍᏗᏱ ᏂᎨᏒᎾ ᏴᏫ ᎠᏁᎲᎢ, ᎤᎵᏂᎩᏛᏯ ᏗᏗᏍᎦᎩ ᏗᏗᏁᏥ, ᎪᎯ ᎢᏳᏓᎴᏅᏛ ᎯᎠ ᎾᏍᎩ ᏚᏙᎥ ᎠᏂᏁᎢᏍᏗᏍᎬ ᎩᎶ ᎤᏂᏬᏁᏙᏗᏱ ᏂᎨᏒᎾ.

source: And they sent for them, and gave them orders not to make statements or give teaching in the name of Jesus.
chr: ᏫᏚᏂᏯᏅᎲᏃ ᏚᏂᏁᏤᎴ ᏥᏌ ᏚᏙᎥ ᎤᏅᏙᏗᏱ ᎤᏂᏁᎢᏍᏗᏱ ᎠᎴ ᏧᎾᏕᏲᏗᏱ ᏂᎨᏒᎾ.

source: But Peter and John in answer said to them, It is for you to say if it is right in the eyes of God to give attention to you more than to God:
chr: ᎠᏎᏃ ᏈᏓ ᎠᎴ ᏣᏂ ᎤᏂᏁᏨ ᎯᎠ ᏂᏚᏂᏪᏎᎴᎢ; ᎢᏳᏃ ᏚᏳᎪᏕᏍᏗ ᎤᏁᎳᏅᎯ ᏙᏗᎧᏂᏍᎬᎢ ᏂᎯ ᎤᏟ ᎢᎦᎢ ᎢᏨᏯᏛᏓᏍᏓᏁᏗᏱ ᎡᏍᎦᏉ ᎤᏁᎳᏅᎯ, ᏗᏧᎪᏓ ᏂᎯ.

source: For it is not possible for us to keep from saying what we have seen and have knowledge of.
chr: ᎥᏝᏰᏃ ᎤᏁᎳᎩ ᎦᏲᎩᏂᏰᎸᏗ ᏱᎩ, ᎣᎩᏂᏁᎢᏍᏙᏗᏱ ᏄᏍᏛ ᎣᎩᏂᎪᎲᎢ, ᎠᎴ ᎣᎩᎾᏛᎦᏅᎢ.

source: And when they had said more sharp words to them, they let them go, not seeing what punishment they might give them, because of the people; for all men were giving praise to God for what had taken place.
chr: ᎠᏏᏃ ᏙᎤᏂᏍᎦᏨ, ᏚᏂᎧᏁᎢ, ᎤᎾᏠᏤ ᎪᎱᏍᏗ ᎬᏩᏂᏍᏛᏗᏍᏗ ᎨᏒᎢ, ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎤᏂᏣᏘ ᏴᏫ, ᏂᎦᏛᏰᏃ ᎠᏂᎸᏉᏗᏍᎨ ᎤᏁᎳᏅᎯ, ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎾᏍᎩ ᏄᎵᏍᏔᏅᎢ.

source: For the man on whom this act of power was done was more than forty years old.
chr: ᎠᏍᎦᏯᏰᏃ ᎾᏍᎩ ᎤᏍᏆᏂᎪᏗ ᎢᏯᎬᏁᎸᎯ ᎠᏥᏅᏩᏅᎯ ᎤᎶᏒᏍᏗ ᏅᎦᏍᎪᎯ ᎢᏳᏕᏘᏴᏛ ᏱᎰᏎᎢ.

source: And when they had been made free, they came back to their friends, and gave an account of all the things which the chief priests and the authorities had said to them.
chr: ᏕᎨᏥᎧᏅᏃ ᎤᎾᎵᎪᏅᎯ ᏗᏂᏅ ᏭᏂᎶᏎᎢ, ᎠᎴ ᏭᏂᏃᎮᎴ ᏂᎦᎥ ᏂᎬᏩᏂᏪᏎᎸ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏗᏂᎳᏫᎩ.

source: And hearing it, they all, with one mind, made prayer to God and said, O Lord, maker of heaven and earth and the sea and all things in them:
chr: ᎾᏍᎩᏃ ᎤᎾᏛᎦᏅ ᏌᏉ ᎢᎦᎦᏛ ᎤᏁᎳᏅᎯ ᎤᏂᏌᎳᏓᏁᎴ ᎠᏂᏁᎬᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ; ᏣᎬᏫᏳᎯ, ᏂᎯ ᏣᏁᎳᏅᎯ, ᏗᏦᏢᏅᎯ ᎦᎸᎶᎢ ᎠᎴ ᎡᎶᎯ ᎠᎴ ᎠᎺᏉᎯ ᎠᎴ ᏂᎦᏛ ᎾᎿ ᎠᏁᎯ;

source: Who has said, by the Holy Spirit, through the mouth of our father David your servant, Why are the nations so violently moved, and why are the thoughts of the people so foolish?
chr: ᎯᏅᏏᏓᏍᏗ ᏕᏫ ᎠᎰᎵ ᏨᏔᏅᎯ ᎯᎠ ᎢᏣᏪᏛ ᏥᎩ; “ᎦᏙᏃ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎤᏂᏔᎳᏬᏎᎢ, ᎠᎴ ᏴᏫ ᎤᎾᏓᏅᏖᎴ ᎢᏳᎾᏛᏁᏗᏱ ᎾᏍᎩ ᎢᎬᏩᎵᏍᏙᏗ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: The kings of the earth were lifted up, the rulers came together, against the Lord, and against his Christ:
chr: ᎤᏂᎬᏫᏳᎯ ᎡᎶᎯ ᎠᏁᎯ ᏚᎾᎴᏅᎩ, ᎠᎴ ᎠᏰᎵ ᏧᏂᎸᏫᏍᏓᏁᎯ ᏚᏂᎳᏫᏨᎩ ᎠᎾᏡᏗᏍᎬ ᎤᎬᏫᏳᎯ ᎠᎴ ᎠᎾᏡᏗᏍᎬ ᎤᏤᎵ ᎦᎶᏁᏛ.”

source: For, truly, in this town, against your holy servant, Jesus, who was marked out by you as Christ, Herod, and Pontius Pilate, with the Gentiles and the people of Israel, came together,
chr: ᎤᏙᎯᏳᎯᏯᏰᏃ ᎠᎾᏡᏗᏍᎬ ᎾᏍᎦᏅᎾ ᏤᏥ ᏥᏌ ᎾᏍᎩ ᎯᎶᏁᏛ ᎢᏧᎳ ᎡᎶᏛ ᎠᎴ ᏆᏂᏗ ᏆᎴᏗ ᎠᎴ ᏴᏫ ᏧᎾᏓᎴᏅᏛ ᎠᎴ ᎢᏏᎵ ᏴᏫ ᏚᏂᎳᏫᏨᎩ,

source: To do that which had been fixed before by your hand and your purpose.
chr: ᎢᏳᎾᏛᏁᏗᏱ ᏂᎦᎥ ᏦᏰᏂ ᎠᎴ ᎭᏓᏅᏖᏍᎬ ᎦᏳᎳ ᏗᏧᎪᏔᏅᎯ ᏥᎨᏎ ᎾᏍᎩ ᎢᏳᎵᏍᏙᏗᏱ.

source: And now, Lord, take note of their cruel words, and give your servants power to be preachers of your word without fear,
chr: Ꭷ ᏣᎬᏫᏳᎯ, ᎿᏉ, ᏔᎧᏅᎦ ᎪᎩᏍᎦᎬ ᏣᏂᏁᎦ, ᎠᎴ ᏔᎵᏍᎪᎸᏓᏏ ᏘᏅᏏᏓᏍᏗ ᎤᏍᏗᎤᏅ ᎾᏂᏍᎦᎢᎲᎾ ᎢᏳᎵᏍᏙᏗᏱ ᏣᏁᏨ ᎠᏂᏃᎮᏍᎬᎢ,

source: While your hand is stretched out to do works of mercy; so that signs and wonders may be done through the name of your holy servant Jesus.
chr: ᎭᏙᏯᎯᏗᏍᎬ ᏕᎯᏅᏫᏍᎬᎢ ᎠᎴ ᎤᏰᎸᏛᎢ ᎠᎴ ᎤᏍᏆᏂᎪᏗ ᏚᏂᎸᏫᏍᏓᏁᎲ ᎠᏅᏗᏍᎬ ᏕᎤᏙᎥ ᏥᏌ ᎾᏍᎦᏅᎾ ᏤᏥ.

source: And when their prayer was ended, the place where they were was violently moved, and they all became full of the Holy Spirit, preaching the word of God without fear.
chr: ᎤᎾᏓᏙᎵᏍᏔᏅᏃ ᎤᎵᏖᎸᏁ ᎾᎿ ᏓᏂᎳᏫᎥᎢ, ᏂᎦᏛᏃ ᏚᏂᎧᎵᏤ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ, ᎠᎴ ᎾᏂᏍᎦᎢᎲᎾ ᎤᏂᏃᎮᎴ ᎧᏃᎮᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ.

source: And all those who were of the faith were one in heart and soul: and not one of them said that any of the things which he had was his property only; but they had all things in common.
chr: ᏂᎦᏛᏃ ᎤᏂᏣᏘ ᎨᏒ ᎤᏃᎯᏳᏅᎯ ᏌᏉᏉ ᏄᏅᏁ ᏧᏂᎾᏫ ᎠᎴ ᏧᎾᏓᏅᏙ; ᎥᏝ ᎠᎴ ᎩᎶ ᎠᏋᏒ ᎠᏆᏤᎵ ᏯᏗᏍᎨ ᎪᎱᏍᏗ ᎤᎲᎢ, ᎠᏰᎵᏉᏰᏃ ᏄᏅᏁᎢ ᏂᎦᎥ ᎪᎱᏍᏗ.

source: And with great power the Apostles gave witness of the coming back of the Lord Jesus from the dead; and grace was on them all.
chr: ᎤᎵᏂᎩᏗᏳᏃ ᎾᏂᏪᏍᎨ ᎨᏥᏪᏍᎨ ᎨᏥᏅᏏᏛ ᎬᏂᎨᏒ ᎾᏅᏁᎲ ᏕᏅᎴᎯᏌᏅ ᎤᎬᏫᏳᎯ ᏥᏌ; ᏂᎦᏛᏃ ᎤᏣᏘ ᎣᏏᏳ ᎨᎦᏓᏅᏖᏍᎨᎢ.

source: And no one among them was in need; for everyone who had land or houses, exchanging them for money, took the price of them,
chr: ᎥᏝ ᎠᎴ ᎩᎶ ᏳᏓᏑᏰ ᏳᏂᎬᎨᎢ, ᎾᏂᎥᏰᏃ ᎦᏓ ᎠᎴ ᏓᏓᏁᎸ ᏧᏂᎯ ᏚᏂᎾᏗᏅᏎᎢ, ᎾᏍᎩᏃ ᎤᏂᎾᏗᏅᏛ ᏧᎬᏩᎳᏅᎯ ᎤᏂᏲᎴᎢ,

source: And put it at the feet of the Apostles for distribution to everyone as he had need.
chr: ᎠᎴ ᎤᏂᏁ ᎨᏥᏅᏏᏛ ᏧᎾᎳᏏᏕᏄᎶᏗ, ᎾᏂᎥᏃ ᎾᏍᎩᏯ ᎤᏂᏂᎬᏎᎲ ᎨᏥᏯᏙᎮᎮᎢ.

source: And Joseph, who was given by the Apostles the name of Barnabas (the sense of which is, Son of comfort), a Levite and a man of Cyprus by birth,
chr: ᏦᏏᏃ ᎨᏥᏅᏏᏛ ᏆᏂᏆ ᏥᏚᏃᎡᎢ, ᎾᏍᎩ ᎦᏛᎬ ᎣᏍᏛ ᎠᏓᏅᏓᏗᏍᏗ ᎤᏪᏥ, ᎠᎵᏫ ᏌᏈ ᎤᏕᏅᎯ,

source: Having a field, got money for it and put the money at the feet of the Apostles.
chr: ᎦᏓ ᎤᎮᎢ, ᎤᎾᏗᏅᏎᎢ, ᎠᎴ ᎠᏕᎸ ᏚᏲᎴᎢ, ᎠᎴ ᎾᏍᎩ ᏕᎤᏁ ᎨᏥᏅᏏᏛ ᏧᎾᎳᏏᏕᏄᎶᏗ.

source: But a certain man named Ananias, with Sapphira his wife, got money for his property,
chr: ᎩᎶᏃ ᎢᏳᏍᏗ ᎠᏍᎦᏯ ᎡᏂᎾᏯ ᏧᏙᎢᏛ, ᎤᏓᎵᎢᏃ ᏌᏉᎵ ᎤᏂᎾᏗᏅᏎ ᎪᎱᏍᏗ ᎤᏂᎲᎢ,

source: And kept back part of the price, his wife having knowledge of it, and took the rest and put it at the feet of the Apostles.
chr: ᎠᎴ ᎤᎯᏰ ᎢᎦᏛ ᏧᎬᏩᎳᏅᎯ, ᎠᎴ ᎤᏓᎵᎢ ᎾᏍᏉ ᎠᎦᏔᎮᎢ; ᎤᏲᎴᏃ ᎢᎦᏛ, ᎠᎴ ᎨᏥᏅᏏᏛ ᏧᎾᎳᏏᏕᏄᎶᏗ ᎤᏁᎢ.

source: But Peter said, Ananias, why has the Evil One put it into your heart to be false to the Holy Spirit, and to keep back part of the price of the land?
chr: ᏈᏓᏃ ᎯᎠ ᏄᏪᏎᎢ; ᎡᏂᎾᏯ, ᎦᏙᏃ ᏎᏓᏂ ᏣᎾᏫ ᎢᏣᎧᎵᎡᎸ, ᎯᏯᏥᎪᏁᏗᏱ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ, ᎠᎴ ᏣᎯᏯᏍᏗᏱ ᎢᎦᏛ ᎾᏍᎩ ᎦᏓ ᏧᎬᏩᎳᏅᎯ.

source: While you had it, was it not your property? and after you had given it in exchange, was it not still in your power? how has this purpose come into your mind? you have been false, not to men, but to God.
chr: ᏥᏅᏩᏍᏛᏉ ᏝᏍᎪ ᏣᏤᎵᎦᏯ ᏱᎨᏎᎢ? ᏣᎾᏗᏅᏃ ᏝᏍᎪ ᏱᏣᎮ ᎭᏓᏅᏖᏍᎬᏉ ᎢᏨᏁᏗᏱ? ᎦᏙᏃ ᎯᎠ ᎾᏍᎩ ᏂᎤᏍᏗ ᎢᏦᏢᏅ ᏣᎾᏫᏱ? ᎥᏝᏍᎩᏂ ᏴᏫᏉ ᏱᎩᏯᏥᎪᏁᎸ, ᎤᏁᎳᏅᎯᏍᎩᏂ ᎯᏯᏥᎪᏁᎸ.

source: And at these words, Ananias went down on the earth, and his life went from him: and great fear came on all who were present.
chr: ᎡᏂᎾᏯᏃ ᎾᏍᎩ ᎤᏛᎦᏅ ᎤᏅᏤ ᎠᎴ ᎤᎵᏍᏆᏕᎴᎢ. ᎾᏂᎥᏃ ᎾᏍᎩ ᏄᎵᏍᏔᏅᎢ ᎤᎾᏛᎦᏅᎯ ᎤᏣᏔᏅᎯ ᎤᏂᎾᏰᏎᎢ.

source: And the young men went and made ready his body, and took it out, and put it in the earth.
chr: ᎠᏂᏫᏅᏃ ᏚᎾᎴᏁ ᎠᎴ ᎤᏂᏣᏄᎳᏁᎢ, ᎤᏂᎾᏫᏛᎲᏃ ᏭᏂᏂᏌᏁᎢ.

source: And about three hours after, his wife, having no knowledge of what had taken place, came in.
chr: ᏦᎢᎭᏃ ᎢᏳᏟᎶᏛ ᎢᏴᏛ ᎣᏂ ᎤᏓᎵᎢ ᎤᏴᎵᎴᎢ, ᎾᎦᏔᎲᎾ ᎨᏎ ᏄᎵᏍᏔᏅᎢ,

source: And Peter said to her, Give me an answer: was this amount of money the price of the land? And she said, Yes, it was.
chr: ᏈᏓᏃ ᎯᎠ ᏂᏅᏪᏎᎴᎢ; ᏍᎩᏃᎲᏏ, ᏥᎪ ᎾᏍᎩᏉ ᎢᎦᎢ ᏕᏍᏓᎬᏩᎳᏁᎴ ᎾᏍᎩ ᎦᏙᎯ? ᎯᎠᏃ ᏄᏪᏎᎢ; ᎥᎥ, ᎾᏍᎩᏉ ᎢᎦᎢ.

source: But Peter said to her, Why have you made an agreement together to be false to the Spirit of the Lord? See, the feet of the young men who have put the body of your husband in the earth, are at the door, and they will take you out.
chr: ᎿᏉᏃ ᏈᏓ ᎯᎠ ᏄᏪᏎᎴᎢ; ᎦᏙᏃ ᏥᏍᏓᎵᎪᏅ ᎡᏍᏗᎪᎵᏰᏗᏱ ᎤᎬᏫᏳᎯ ᎤᏤᎵ ᎠᏓᏅᏙ? ᎬᏂᏳᏉ ᎠᏉ ᎦᎶᎯᏍᏗᏱ ᏧᎾᎳᏏᏕᏂ ᏣᏰᎯ ᎬᏩᏂᏌᏅᎯ, ᎾᏍᎩᏃ ᏂᎯ ᏛᎨᏣᎾᏫᏛᎯ.

source: And straight away she went down at his feet, and her life went from her: and the young men came in and saw her dead, and they took her out and put her in the earth with her husband.
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᏧᎳᏏᏕᏄᎶᏗ ᎤᏅᏤᎢ, ᎠᎴ ᎤᎵᏍᏆᏕᎴᎢ. ᎠᏂᏫᏅᏃ ᎤᏂᏴᎸ ᎤᏂᏩᏛᎮ ᎤᏲᎱᏒᎯ ᎢᎨᏎᎢ, ᎤᏂᎾᏫᏛᎲᏃ ᏭᏂᏂᏌᏁ ᎤᏰᎯ ᏫᎦᏅᎢ.

source: Then great fear came on all the church and on all who had knowledge of these things.
chr: ᏂᎦᏛᏃ ᏧᎾᏁᎶᏗ ᎤᎾᏓᏡᎬ ᎤᏣᏔᏅᎯ ᎤᏂᎾᏰᏎᎢ, ᎠᎴ ᎾᏍᏉ ᏂᎦᏛ ᎯᎠ ᎾᏍᎩ ᏄᎵᏍᏔᏅ ᎠᎾᏛᎩᏍᎩ.

source: Now a number of signs and wonders were done among the people by the hands of the Apostles; and they were all together in Solomon's covered way.
chr: ᎨᏥᏅᏏᏛᏃ ᎤᏣᏖ ᎤᏰᎸᏛ ᎠᎴ ᎤᏍᏆᏂᎪᏗ ᏚᏂᎸᏫᏍᏓᏁᎮ ᏴᏫ ᎠᏁᎲᎢ. ᏂᎦᏛᏃ ᏌᏉ ᎢᎦᎦᏛ ᎠᏂᏁ ᏐᎵᎹᏅ ᎤᏤᎵ ᎠᏲᏓᏝᎲᎢ.

source: The others, in fear, kept back from joining them: but the people made much of them;
chr: ᎠᏂᏐᎢᏃ ᎠᏂᏍᎦᎢᎮ ᎬᏩᎾᎵᎪᏁᏗᏱ; ᎤᏂᏣᏘᏍᎩᏂ ᏴᏫ ᎬᏩᏂᎸᏉᏗᏳ ᎨᏎᎢ.

source: And a great number of men and women had faith, and were joined to the Lord;
chr: ᎠᏃᎯᏳᎲᏍᎩᏃ ᎤᏟ ᏂᎦᎡ ᎬᏩᏁᏉᏤᎴ ᎤᎬᏫᏳᎯ, ᎤᏂᏣᏔᏅᎯ ᎨᏎ ᎠᏂᏍᎦᏯ ᎠᎴ ᎠᏂᎨᏴ.

source: And they even took into the streets people who were ill, and put them on beds, so that when Peter went by, some of them might be in his shade.
chr: ᏚᏜᏅᏛᏰᏃ ᏓᏂᏃᎯᎮ ᏧᏂᏢᎩ, ᏗᏤᏍᏙ ᎠᎴ ᏗᎦᏂᏟ ᏓᏂᏢᏗᏍᎨᎢ ᎾᏍᎩ ᎤᏓᏩᏗᏍᏛᏉ ᎾᏍᏉ ᏈᏓ ᎠᎢᏒᎢ ᎢᎦᏛ ᎤᏄᏢᏙᏗᏱ.

source: And numbers of people came together from the towns round about Jerusalem, with those who were ill and those who were troubled with unclean spirits: and they were all made well.
chr: ᎾᏍᏉᏃ ᎤᏂᏣᏖ ᏕᎦᏚᏩᏗᏒ ᏅᏓᏳᏂᎶᏒᎯ ᏥᎷᏏᎵᎻ ᎠᏂᎷᎨᎢ, ᏓᎾᏖᏃᎯᎮ ᏧᏂᏢᎩ ᎠᎴ ᎠᏂᏍᎩᎾ ᎬᏩᏂᏱᎵᏙᎯ; ᏂᎦᏛᏃ ᏕᎨᏥᏅᏩᏁᎢ.

source: But the high priest and those who were with him (the Sadducees) were full of envy,
chr: ᎿᏉᏃ ᏄᎬᏫᏳᏒ ᎠᏥᎸ-ᎨᎶᎯ ᏚᎴᏅ ᎠᎴ ᏂᎦᏛ ᎬᏩᎵᎪᏁᎯ, ᎾᏍᎩ ᎠᏂᏌᏚᏏ ᏧᎾᏙᎢᏛ ᏥᎩ, ᎤᏂᎧᎵᏤ ᎤᏂᏔᎳᏬᏍᎬᎢ;

source: And they took the Apostles and put them in the common prison.
chr: ᎠᎴ ᏚᏂᏂᏴᎮ ᎨᏥᏅᏏᏛ ᎠᎴ ᏗᏓᏍᏚᏗᏱ ᏚᏂᏴᏔᏁᎢ.

source: But in the night an angel of the Lord, opening the doors of the prison, took them out and said,
chr: ᎠᏎᏃ ᏗᎧᎿᏩᏗᏙᎯ ᎤᎬᏫᏳᎯ ᎤᏤᎵᎦ ᏒᏃᏱ ᏚᏍᏚᎢᏎ ᏗᏓᏍᏚᏗᏱ ᎦᎶᎯᏍᏗᏱ, ᏚᏄᎪᏫᏒᏃ ᎯᎠ ᏄᏪᏎᎢ;
